app/views/users/show.html.erb

	<br>
  <% @user.microposts.each do |micropost| %>
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 4]]