app/views/microposts/_form.html.erb

    <%= f.label :user_id %><br>
    <%= f.select:user_id,options_for_select(User.all.ids) %>
---
SELECT "users"."id" FROM "users"